{
    "Common Rice Diseases": "ជំងឺស្រូវទូទៅ",
    "Home": "ទំព័រដើម",
    "Saved": "រក្សាទុក",
    "Profile": "ប្រវត្តិរូប",
    "No saved diagnoses yet!": "មិនមានការធ្វើវិនិច្ឆ័យដែលបានរក្សាទុកនៅឡើយទេ!",
    "Saved Diagnoses": "ការធ្វើវិនិច្ឆ័យដែលបានរក្សាទុក",
    "No diagnoses available": "មិនមានការធ្វើវិនិច្ឆ័យណាមួយទេ",
    "Error loading diagnoses": "កំហុសក្នុងការទាញយកការធ្វើវិនិច្ឆ័យ",
    "Recent Diagnoses": "ការធ្វើវិនិច្ឆ័យថ្មីៗ",
    "Your Reports": "របាយការណ៍របស់អ្នក",
    "Part of Disease": "ផ្នែកនៃជំងឺ",
    "No reports yet": "មិនមានរបាយការណ៍នៅឡើយទេ",
    "Your submitted reports will appear here": "របាយការណ៍ដែលអ្នកបានដាក់ស្នើនឹងបង្ហាញនៅទីនេះ",
    "Delete Report": "លុបរបាយការណ៍",
    "Are you sure you want to delete this report": "តើអ្នកប្រាកដជាចង់លុបរបាយការណ៍នេះទេ?",
    "Cancel": "បោះបង់",
    "Delete": "លុប",
    "Report submitted successfully!": "របាយការណ៍បានដាក់ស្នើដោយជោគជ័យ!",
    "Report updated successfully!": "របាយការណ៍បានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ!",
    "Please fill in all fields and select an image.": "សូមបំពេញវាលទាំងអស់ និងជ្រើសរូបភាព។",
    "Report Disease": "រាយការណ៍ជំងឺ",
    "Report Details": "ព័ត៌មានលម្អិតរបាយការណ៍",
    "Edit Report": "កែសម្រួលរបាយការណ៍",
    "Description": "ការពិពណ៌នា",
    "Affected Part: ": "ផ្នែកដែលទាក់ទង: ",
    "Symptoms: ": "រោគសញ្ញា: ",
    "Management: ": "ការគ្រប់គ្រង: ",
    "Login": "ចូល",
    "Not a member yet?": "មិនមែនជាសមាជិកនៅឡើយទេ?",
    "Create an Account": "បង្កើតគណនី",
    "Position object within frame": "ដាក់វត្ថុក្នុងស៊ុម",
    "Scan Rice": "ស្កេនស្រូវ",
    "Processing...": "កំពុងដំណើរការ...",
    "Upload from Gallery": "បញ្ចូលពីបណ្ណាល័យរូបភាព",
    "Diagnosis saved": "ការធ្វើវិនិច្ឆ័យបានរក្សាទុក",
    "unknown": "មិនស្គាល់",
    "Unknown disease": "ជំងឺមិនស្គាល់",
    "No info": "គ្មានព័ត៌មាន",
    "Analysis Result": "លទ្ធផលវិភាគ",
    "Results": "លទ្ធផល",
    "Scan Again": "ស្កេនម្តងទៀត",
    "Classification": "ការបែងចែក",
    "Details": "ព័ត៌មានលម្អិត",
    "Confidence": "ការប្រាកដភាព",
    "Symptoms": "រោគសញ្ញា",
    "Management": "ការគ្រប់គ្រង",
    "Common Disease": "ជំងឺទូទៅ",
    "Manage": "គ្រប់គ្រង",
    "Select Disease Type": "ជ្រើសរើសប្រភេទជំងឺ",
    "Select image": "ជ្រើសរូបភាព",
    "Name": "ឈ្មោះ",
    "Type here...": "វាយនៅទីនេះ...",
    "Submit": "ដាក់ស្នើ",
    "Update": "ធ្វើបច្ចុប្បន្នភាព",
    "Report submitted successfully": "របាយការណ៍បានដាក់ស្នើដោយជោគជ័យ!",
    "Report updated successfully": "របាយការណ៍បានធ្វើបច្ចុប្បន្នភាពដោយជោគជ័យ!",
    "Please fill in all fields": "សូមបំពេញវាលទាំងអស់ និងជ្រើសរូបភាព។",
    "No saved diagnoses yet": "មិនទាន់មានការធ្វើរោគវិនិច្ឆ័យដែលបានរក្សាទុកទេ!",
    "Image not available": "រូបភាពមិនមាន",
    "Diagnosis removed": "ការធ្វើរោគវិនិច្ឆ័យត្រូវបានលុប",
    "Rice Scan": "ស្កេនស្រូវ",
    "Part of Disease: ": "ផ្នែកនៃជំងឺ: ",
    "No recent Diagnoses": "មិនមានការធ្វើវិនិច្ឆ័យថ្មីៗ",
    "Select Language": "ជ្រើសរើសភាសា",
    "Edit Profile": "កែសម្រួលប្រវត្តិរូប",
    "Close": "បិទ",
    "Your reports": "របាយការណ៍របស់អ្នក",
    "Logout": "ចាកចេញ",
    "Language": "ភាសា",
    "Email": "អុីម៉ែល",

    "Change Password?": "ផ្លាស់ប្តូរពាក្យសម្ងាត់?",
    "New Password": "ពាក្យសម្ងាត់ថ្មី",
    "Password": "ពាក្យសម្ងាត់",
    "Confirm Password": "បញ្ជាក់ពាក្យសម្ងាត់",
    "Full Name": "ឈ្មោះពេញ",
    "Already have an account?": "មានគណនីរួចហើយឬនៅ?",
    "Create account": "បង្កើតគណនី",

    "Email Address": "អាសយដ្ឋានអ៊ីមែល",
    "Enter your email address": "បញ្ចូលអាសយដ្ឋានអ៊ីមែលរបស់អ្នក",
    "Enter your password": "បញ្ចូលពាក្យសម្ងាត់របស់អ្នក",
    "Forgot password?": "ភ្លេចពាក្យសម្ងាត់?",
    "Please enter a valid email address": "សូមបញ្ចូលអាសយដ្ឋានអ៊ីមែលដែលត្រឹមត្រូវ",
    "Login failed": "ការចូលបានបរាជ័យ",

    "login": "ចូល",
    "logout": "ចាកចេញ",
    "email": "អ៊ីមែល",
    "password": "ពាក្យសម្ងាត់",
    "full_name": "ឈ្មោះពេញ",
    "enter_email": "បញ្ចូលអ៊ីមែលរបស់អ្នក",
    "enter_password": "បញ្ចូលពាក្យសម្ងាត់របស់អ្នក",
    "enter_name": "បញ្ចូលឈ្មោះពេញរបស់អ្នក",
    "forgot_password": "ភ្លេចពាក្យសម្ងាត់?",
    "create_account": "បង្កើតគណនី",
    "already_have_account": "មានគណនីរួចហើយ?",
    "invalid_email": "សូមបញ្ចូលអ៊ីមែលដែលត្រឹមត្រូវ",
    "fill_all_fields": "សូមបំពេញគ្រប់ផ្នែក",
    "weak_password": "ពាក្យសម្ងាត់ត្រូវតែយ៉ាងហោចណាស់ ៨ តួអក្សរ",
    "email_in_use": "អ៊ីមែលនេះបានប្រើរួចហើយ",
    "invalid_credentials": "អ៊ីមែល ឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ",
    "profile": "ប្រវត្តិរូប",
    "edit_profile": "កែប្រែប្រវត្តិរូប",
    "your_reports": "របាយការណ៍របស់អ្នក",
    "select_language": "ជ្រើសរើសភាសា",
    "language": "ភាសា",
    "close": "បិទ",

    "Leaf Blast": "ជំងឺប្លាស្ត",
    "Brown Spot": "ជំងឺចំណុចត្នោត",
    "Tungro": "ជំងឺតុងហ្គ្រូ",
    "Bacterial Blight": "ជំងឺបាក់តេរី",
    "Sheath Blight": "ជំងឺស្បែកស្លឹក",
    "Healthy": "សុខភាពល្អ",
    "Hispa": "ជំងឺហ៊ីស្ប៉ា",


    "Leaves": "ស្លឹក",
    "Sheath": "សំបក",
    "Grains": "គ្រាប់",
    "Stem": "ដើម",
    "Whole Plant": "រុក្ខជាតិទាំងមូល",


  

      "Bacterial": "បាក់តេរី",
      "Fungal": "ផ្សិត",
      "Viral": "វីរុស",
      "Pest": "សត្វល្អិត",
      "none": "គ្មាន",

      "BacterialBlightDescription": "បង្កឱ្យមានឆ្នូតលឿង និងស្លឹករសាត់។",
      "BacterialBlightSymptoms": "នៅលើសំណាប ស្លឹកដែលឆ្លងមានពណ៌ប្រផេះបៃតង និងរមូរឡើង។ នៅពេលជំងឺរីកចម្រើន ស្លឹកប្រែជាពណ៌លឿងទៅជាពណ៌ចំបើង និងរសាត់ ធ្វើឱ្យសំណាបទាំងមូលស្ងួត និងស្លាប់ (ហៅថា 'kresek')។ នៅលើរុក្ខជាតិចាស់ ឆ្នូតដែលត្រាំទឹកទៅជាពណ៌លឿងលេចឡើងតាមសរសៃស្លឹក ប្រែជាពណ៌ប្រផេះស ជាមួយនឹងគែមរលក។ ទឹកសន្សើមពណ៌ទឹកដោះគោ ឬស្រអាប់ដែលមានបាក់តេរីអាចហូរចេញពីតំបន់ដែលរងផលប៉ះពាល់ ហួតទៅជាសំបក។",
      "BacterialBlightManagement": "ដាំពូជធន់ (ឧ. PSB Rc82)។ ធានាការបង្ហូរទឹកល្អនៅក្នុងវាលស្រែ និងកន្លែងបណ្តុះ។ ដកស្មៅដែលជាម៉ាស៊ីន និងភ្ជួរដីក្រោមសំណល់ស្រូវ ចំបើង សំណល់ដើម និងសំណាបស្ម័គ្រចិត្ត។ ទុកឱ្យវាលទំនេរស្ងួតដើម្បីទប់ស្កាត់បាក់តេរីនៅក្នុងដី និងសំណល់។ ប្រើបរិមាណជីជាតិរុក្ខជាតិដែលមានតុល្យភាព ជាពិសេសអាសូត។",

      "BrownSpotDescription": "ចំណុចត្នោតជាមួយកណ្តាលពណ៌ប្រផេះនៅលើស្លឹក និងគ្រាប់។",
      "BrownSpotSymptoms": "ចំណុចរាងមូលទៅរាងពងក្រពើជាច្រើននៅលើស្លឹក សំបកស្លឹក សំបកស្លឹកខាងក្នុង មែកបន្ទាត់ សំបកគ្រាប់ និងគ្រាប់តូចៗ។ ចំណុចមានពណ៌ត្នោតជាមួយកណ្តាលពណ៌ប្រផេះ ព័ទ្ធជុំវិញដោយគែមក្រហម ប្រវែងរហូតដល់ ១០ មម។ នៅលើគ្រាប់ រោគសញ្ញា 'ចំណុចភ្នែក' ជាមួយគែមត្នោត និងកណ្តាលភ្លឺ។ ការឆ្លងធ្ងន់ធ្ងរអាចសម្លាប់ស្លឹក និងបណ្តាលឱ្យគ្រាប់មិនបំពេញ ឬប្រែពណ៌ ('pecky rice')។",
      "BrownSpotManagement": "ប្រើពូជធន់។ ព្យាបាលគ្រាប់ជាមួយទឹកក្តៅ (៥៣-៥៤ អង្សាសេ រយៈពេល ១០-១២ នាទី)។ លាបជីតាមអត្រាដែលបានណែនាំដើម្បីកែតម្រូវកង្វះសារធាតុចិញ្ចឹម (ជាពិសេសប៉ូតាស្យូម)។ ប្រមូល និងដុតចំបើង និងកំទេចកំទីបន្ទាប់ពីប្រមូលផល ឬភ្ជួរចូលក្នុងដី។ ថ្នាំសម្លាប់ផ្សិតដូចជា iprodione, azoxystrobin, trifloxystrobin, propiconazole ឬ carbendazim អាចប្រើបានប្រសិនបើចាំបាច់។",
      
      "HealthyDescription": "គ្មានរោគសញ្ញាជំងឺ ស្លឹកបៃតងមានសុខភាពល្អ។",
      "HealthySymptoms": "គ្មានរោគសញ្ញាជំងឺ។ ស្លឹកមានពណ៌បៃតងស្មើគ្នា គ្មានចំណុច ការប្រែពណ៌ ឬការរសាត់។ រុក្ខជាតិលូតលាស់ខ្លាំងជាមួយនឹងគ្រាប់ដែលបំពេញបានល្អ។",
      "HealthyManagement": "រក្សាការអនុវត្តកសិកម្មល្អ៖ ការស្រោចទឹកត្រឹមត្រូវ ជីជាតិមានតុល្យភាព និងការគ្រប់គ្រងសត្វល្អិតដើម្បីការពារការចាប់ផ្តើមនៃជំងឺ។",
     
      "HispaDescription": "ការកោសបែបជណ្តើរនៅលើស្លឹកដោយសត្វកញ្ជាំ។",
      "HispaSymptoms": "មិនមែនជំងឺទេ ប៉ុន្តែជាសត្វល្អិតបំផ្លាញ (សត្វកញ្ជាំស្រូវ)។ មនុស្សធំកោសផ្ទៃខាងលើនៃស្លឹក ទុកតែសរសៃ បង្កើតរូបរាងបែបជណ្តើរ។ ដង្កូវរុករករវាងសរសៃស្លឹក បណ្តាលឱ្យមានចំណុចត្នោតស្ងួត។",
      "HispaManagement": "រើសសត្វកញ្ជាំដោយដៃនៅវាលតូចៗ។ ប្រើអន្ទាក់ពន្លឺដើម្បីតាមដាន និងកាត់បន្ថយចំនួនមនុស្សធំ។ ប្រើថ្នាំសម្លាប់សត្វល្អិតដូចជា carbaryl ឬ malathion ប្រសិនបើការរាតត្បាតធ្ងន់ធ្ងរ ដោយធ្វើតាមការណែនាំក្នុងស្រុក។",

      "LeafBlastDescription": "ចំណុចពណ៌ប្រផេះសលើស្លឹក។",
      "LeafBlastSymptoms": "ស្នាមរបួសពណ៌សទៅប្រផេះបៃតង ឬចំណុចជាមួយគែមបៃតងខ្មៅនៅលើស្លឹក ចាប់ផ្តើមតូច ហើយពង្រីក។ ក្នុងករណីធ្ងន់ធ្ងរ ចំណុចប្រែជាពណ៌ប្រផេះសជាមួយកណ្តាលស្លាប់ សម្លាប់ស្លឹក។ នៅដំណាក់កាលសំណាប វាអាចសម្លាប់រុក្ខជាតិ; នៅដំណាក់កាលក្រោយ វាប៉ះពាល់ដល់ការបំពេញគ្រាប់។",
      "LeafBlastManagement": "ដាំពូជធន់។ ជៀសវាងជីអាសូតលើស។ រក្សាទឹកជំនន់នៅ ៤-៦ អ៊ីញប្រសិនបើបង្ហូរទឹក។ ប្រើថ្នាំសម្លាប់ផ្សិតដូចជា tricyclazole ឬ azoxystrobin ក្នុងដំណាក់កាលឆ្លងដំបូងប្រសិនបើចាំបាច់។",

      "SheathBlightDescription": "ស្នាមរបួសពណ៌ប្រផេះបៃតងនៅលើសំបក។",
      "SheathBlightSymptoms": "ស្នាមរបួសរាងពងក្រពើ ឬរាងអេលីបពណ៌ប្រផេះបៃតង ប្រវែង ១-៣ សម នៅលើសំបកស្លឹកជិតខ្សែទឹក ប្រែជាពណ៌ប្រផេះសជាមួយគែមត្នោត។ ស្នាមរបួសរីករាលដាលទៅផ្នែកខាងលើរបស់រុក្ខជាតិ រួមទាំងស្លឹក បណ្តាលឱ្យមានស្នាមរបួសមិនទៀងទាត់ពណ៌ត្នោតស្រាល។ អាចមាន sclerotia (ដុំផ្សិតរឹងតូចៗ)។ ករណីធ្ងន់ធ្ងរកាត់បន្ថយផ្ទៃស្លឹក និងបណ្តាលឱ្យគ្រាប់ទទេ។",
      "SheathBlightManagement": "គ្មានពូជធន់ពេញលេញទេ។ កាត់បន្ថយអត្រាបណ្តុះ និងជៀសវាងអាសូតលើស។ គ្រប់គ្រងស្មៅ និងស្មៅស្រូវ។ ប្រើថ្នាំសម្លាប់ផ្សិតលើស្លឹក (ឧ. propiconazole, azoxystrobin) ប្រសិនបើសន្សំសិកម្ម ជាពិសេសប្រសិនបើស្លឹកទង់រងផលប៉ះពាល់។",

      "TungroDescription": "ការប្រែពណ៌ស្លឹកជាពណ៌លឿងទឹកក្រូច និងការលូតលាស់ខ្លី។",
      "TungroSymptoms": "ការប្រែពណ៌ស្លឹក (លឿងទៅលឿងទឹកក្រូច ជាពិសេសស្លឹកចាស់) ការលូតលាស់ខ្លី ចំនួនមែកតិច និងបន្ទាត់តូចៗ មិនបញ្ចេញទាំងស្រុង ជាមួយគ្រាប់គ្មានកូន ឬបំពេញតែមួយផ្នែក គ្របដណ្តប់ដោយចំណុចត្នោតខ្មៅ។ ស្លឹកវ័យក្មេងមានសភាពច្របូកច្របល់។ ធ្ងន់ធ្ងរបំផុតក្នុងដំណាក់កាលបន្លែ ជាពិសេសការបែកមែក។",
      "TungroManagement": "ដាំពូជធន់។ ភ្ជួរសំណល់ដែលឆ្លងភ្លាមៗបន្ទាប់ពីប្រមូលផលដើម្បីកាត់បន្ថយសត្វស្លឹកប៉ុក និងប្រភពឆ្លង។ ជៀសវាងការដាំយឺតធៀបនឹងកាលបរិច្ឆេទមធ្យមនៅក្នុងតំបន់។ គ្រប់គ្រងចំនួនសត្វស្លឹកប៉ុកជាមួយថ្នាំសម្លាប់សត្វល្អិតប្រសិនបើចាំបាច់។"


  }